/* Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее.*/
Console.WriteLine("Input first number: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number: ");
int number2 = Convert.ToInt32(Console.ReadLine());
if (number1 > number2)
{
    Console.WriteLine("number1");
}
else 
{
    Console.WriteLine("number2");
}
/* Напишите программу, которая принимает на вход три числа и выдает максимальное из этих чисел.*/

/* Напишите программу, которая принимает на вход число и выдает, является ли число четным. */

/*Напишите программу, которая принимает на вход число (N,), а на выходе показывает все четные числа от 1 до N. */